In [1]:
import pandas as pd
f_detail = pd.read_csv('AdvWorksCusts.csv')
f_status = pd.read_csv('AW_BikeBuyer.csv')
data = pd.concat([f_detail, f_status['BikeBuyer']], axis=1)

In [2]:
f_detail.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,BirthDate,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome
0,11000,NaN,Jon,V,Yang,NaN,3761 N. 14th St,NaN,Rockhampton,Queensland,...,1966-04-08,Bachelors,Professional,M,M,1,0,0,2,137947
1,11001,NaN,Eugene,L,Huang,NaN,2243 W St.,NaN,Seaford,Victoria,...,1965-05-14,Bachelors,Professional,M,S,0,1,3,3,101141
2,11002,NaN,Ruben,NaN,Torres,NaN,5844 Linden Land,NaN,Hobart,Tasmania,...,1965-08-12,Bachelors,Professional,M,M,1,1,3,3,91945
3,11003,NaN,Christy,NaN,Zhu,NaN,1825 Village Pl.,NaN,North Ryde,New South Wales,...,1968-02-15,Bachelors,Professional,F,S,0,1,0,0,86688
4,11004,NaN,Elizabeth,NaN,Johnson,NaN,7553 Harness Circle,NaN,Wollongong,New South Wales,...,1968-08-08,Bachelors,Professional,F,S,1,4,5,5,92771

In [3]:
data = pd.concat([data,pd.get_dummies(data['Occupation'], prefix='Occupation',
                                 dummy_na=True)],axis=1).drop(['Occupation'],axis=1)
data = pd.concat([data,pd.get_dummies(data['Gender'], prefix='Gender',
                                 dummy_na=True)],axis=1).drop(['Gender'],axis=1)
data = pd.concat([data,pd.get_dummies(data['MaritalStatus'], prefix='MaritalStatus',
                                 dummy_na=True)],axis=1).drop(['MaritalStatus'],axis=1)
data.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Occupation_Manual,Occupation_Professional,Occupation_Skilled Manual,Occupation_nan,Gender_F,Gender_M,Gender_nan,MaritalStatus_M,MaritalStatus_S,MaritalStatus_nan
0,11000,NaN,Jon,V,Yang,NaN,3761 N. 14th St,NaN,Rockhampton,Queensland,...,0,1,0,0,0,1,0,1,0,0
1,11001,NaN,Eugene,L,Huang,NaN,2243 W St.,NaN,Seaford,Victoria,...,0,1,0,0,0,1,0,0,1,0
2,11002,NaN,Ruben,NaN,Torres,NaN,5844 Linden Land,NaN,Hobart,Tasmania,...,0,1,0,0,0,1,0,1,0,0
3,11003,NaN,Christy,NaN,Zhu,NaN,1825 Village Pl.,NaN,North Ryde,New South Wales,...,0,1,0,0,1,0,0,0,1,0
4,11004,NaN,Elizabeth,NaN,Johnson,NaN,7553 Harness Circle,NaN,Wollongong,New South Wales,...,0,1,0,0,1,0,0,0,1,0

In [4]:
list(data)

['CustomerID',
 'Title',
 'FirstName',
 'MiddleName',
 'LastName',
 'Suffix',
 'AddressLine1',
 'AddressLine2',
 'City',
 'StateProvinceName',
 'CountryRegionName',
 'PostalCode',
 'PhoneNumber',
 'BirthDate',
 'Education',
 'HomeOwnerFlag',
 'NumberCarsOwned',
 'NumberChildrenAtHome',
 'TotalChildren',
 'YearlyIncome',
 'BikeBuyer',
 'Occupation_Clerical',
 'Occupation_Management',
 'Occupation_Manual',
 'Occupation_Professional',
 'Occupation_Skilled Manual',
 'Occupation_nan',
 'Gender_F',
 'Gender_M',
 'Gender_nan',
 'MaritalStatus_M',
 'MaritalStatus_S',
 'MaritalStatus_nan']

In [5]:
X=data[['Occupation_Clerical','Occupation_Management',
       'Occupation_Manual','Occupation_Professional',
       'Occupation_Skilled Manual','Occupation_nan',
       'Gender_F','Gender_M',
       'Gender_nan','MaritalStatus_M',
       'MaritalStatus_S','MaritalStatus_nan','NumberCarsOwned','NumberChildrenAtHome','YearlyIncome']]
y=data['BikeBuyer']

In [6]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)
X_train.shape

(11067, 15)

In [7]:
X_train.head()

,Occupation_Clerical,Occupation_Management,Occupation_Manual,Occupation_Professional,Occupation_Skilled Manual,Occupation_nan,Gender_F,Gender_M,Gender_nan,MaritalStatus_M,MaritalStatus_S,MaritalStatus_nan,NumberCarsOwned,NumberChildrenAtHome,YearlyIncome
10009,0,0,0,1,0,0,0,1,0,1,0,0,2,0,98736
7408,1,0,0,0,0,0,0,1,0,1,0,0,0,0,24470
11358,0,0,0,1,0,0,1,0,0,1,0,0,0,1,84214
11909,0,0,0,0,1,0,0,1,0,1,0,0,2,2,95687
6596,0,1,0,0,0,0,0,1,0,1,0,0,1,4,146121

In [8]:
y_train[y_train==0].shape

(7433,)

In [9]:
from sklearn.model_selection import GridSearchCV
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score
import numpy as np
rfc=RandomForestClassifier(random_state=42)

In [10]:
param_grid = { 
    'n_estimators': [100,200,300,400,500,600],
    'max_features': ['auto', 'sqrt', 'log2'],
    'max_depth' : [2,3,4,5,6,7,8,9,10],
    'criterion' :['gini', 'entropy']
}

In [9]:
CV_rfc = GridSearchCV(estimator=rfc, param_grid=param_grid, cv= 5)
CV_rfc.fit(X_train, y_train)

GridSearchCV(cv=5, error_score='raise',
       estimator=RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=10, n_jobs=1,
            oob_score=False, random_state=42, verbose=0, warm_start=False),
       fit_params=None, iid=True, n_jobs=1,
       param_grid={'n_estimators': [100, 200, 300, 400, 500, 600], 'max_features': ['auto', 'sqrt', 'log2'], 'max_depth': [2, 3, 4, 5, 6, 7, 8, 9, 10], 'criterion': ['gini', 'entropy']},
       pre_dispatch='2*n_jobs', refit=True, return_train_score='warn',
       scoring=None, verbose=0)

In [10]:
CV_rfc.best_params_

{'criterion': 'gini',
 'max_depth': 7,
 'max_features': 'auto',
 'n_estimators': 300}

In [11]:
rfc1=RandomForestClassifier(random_state=42, max_features='auto', n_estimators= 300, max_depth=7, criterion='gini')
rfc1.fit(X_train, y_train)
pred=rfc1.predict(X_test)
print("Accuracy for Random Forest on CV data: ",accuracy_score(y_test,pred))

Accuracy for Random Forest on CV data:  0.7855832721936904